[{"title":"A Survey of Racks and Quandles: Some recent developments","link":"http://arxiv.org/abs/1910.07400v1","summary":"  This short survey contains some recent developments of the algebraic theory\nof racks and quandles. We report on some elements of representation theory of\nquandles and ring theoretic approach to quandles.\n","date":"2019-10-16T15:09:10Z","authors":["\n      Mohamed Elhamdadi\n    "]},{"title":"Cohomology and Formal Deformations of Left Alternative Algebras","link":"http://arxiv.org/abs/0907.1548v1","summary":"  The purpose of this paper is to introduce an algebraic cohomology and formal\ndeformation theory of left alternative algebras. Connections to some other\nalgebraic structures are given also.\n","date":"2009-07-09T13:45:31Z","authors":["\n      Mohamed Elhamdadi\n    ","\n      Abdenacer Makhlouf\n    "]},{"title":"Distributivity in Quandles and Quasigroups","link":"http://arxiv.org/abs/1209.6518v1","summary":"  Distributivity in algebraic structures appeared in many contexts such as in\nquasigroup theory, semigroup theory and algebraic knot theory. In this paper we\ngive a survey of distributivity in quasigroup theory and in quandle theory.\n","date":"2012-09-28T13:43:11Z","authors":["\n      Mohamed Elhamdadi\n      University of South Florida\n    "]},{"title":"Circular orderability and quandles","link":"http://arxiv.org/abs/2204.09458v1","summary":"  In this paper, we introduce the notion of circular orderability for quandles.\nWe show that the set all right (respectively left) circular orderings of a\nquandle is a compact topological space. We also show that the space of right\n(respectively left) orderings of a quandle embeds in its space of right\n(respectively left) circular orderings. Examples of quandles that are not left\ncircularly orderable and examples of quandles that are neither left nor right\ncircularly orderable are given.\n","date":"2022-04-20T13:43:17Z","authors":["\n      Idrissa Ba\n    ","\n      Mohamed Elhamdadi\n    "]},{"title":"Hom-quasi-bialgebras","link":"http://arxiv.org/abs/1209.0988v1","summary":"  The purpose of this paper is to give a general survey of Hom-bialgebras,\nwhich are bialgebra-type structures where the identities are twisted by a\nmorphism, and to extend the concept of quasi-bialgebra to Hom-setting. We\nprovide some key constructions and generalize the concept of gauge\ntransformation and Drinfeld's twists to this type of generalized\nquasi-bialgebras. Moreover, we provide an example of twisted quantum double.\n","date":"2012-09-05T14:06:08Z","authors":["\n      Mohamed Elhamdadi\n    ","\n      Abdenacer Makhlouf\n    "]},{"title":"Deformations of Hom-Alternative and Hom-Malcev algebras","link":"http://arxiv.org/abs/1006.2499v1","summary":"  The aim of this paper is to extend Gerstenhaber formal deformations of\nalgebras to the case of Hom-Alternative and Hom-Malcev algebras. We construct\ndeformation cohomology groups in low dimensions.\n  Using a composition construction, we give a procedure to provide deformations\nof alternative algebras (resp. Malcev algebras) into Hom-alternative algebras\n(resp. Hom-Malcev algebras). Then it is used to supply examples for which we\ncompute some cohomology invariants.\n","date":"2010-06-12T23:03:53Z","authors":["\n      Mohamed Elhamdadi\n    ","\n      Abdenacer Makhlouf\n    "]},{"title":"Foundations of the Colored Jones Polynomial of singular knots","link":"http://arxiv.org/abs/1705.02446v3","summary":"  This article gives the foundations of the colored Jones polynomial for\nsingular knots. We extend Masbum and Vogel's algorithm to compute the colored\nJones polynomial for any singular knot. We also introduce the tail of the\ncolored Jones polynomial of singular knots and use its stability properties to\nprove a false theta function identity that goes back to Ramanujan.\n","date":"2017-05-06T05:10:51Z","authors":["\n      Mohamed Elhamdadi\n    ","\n      Mustafa Hajij\n    "]},{"title":"N-Degeneracy in rack homology and link invariants","link":"http://arxiv.org/abs/1007.3550v2","summary":"  The aim of this paper is to define a homology theory for racks with finite\nrank N and use it to define invariants of knots generalizing the CJKLS\n2-cocycle invariants related to the invariants defined in [15]. For this\npurpose, we prove that N -degenerate chains form a sub-complex of the classical\ncomplex defining rack homology. If a rack has rack rank N = 1 then it is a\nquandle and our homology theory coincides with the CKJLS homology theory [6].\nNontrivial cocycles are used to define invariants of knots and examples of\ncalculations for classical knots with up to 8 crossings and classical links\nwith up to 7 crossings are provided.\n","date":"2010-07-21T01:42:47Z","authors":["\n      Mohamed Elhamdadi\n    ","\n      Sam Nelson\n    "]},{"title":"Automorphism groups of Quandles","link":"http://arxiv.org/abs/1012.5291v1","summary":"  We prove that the automorphism group of the dihedral quandle with n elements\nis isomorphic to the affine group of the integers mod n, and also obtain the\ninner automorphism group of this quandle. In [9], automorphism groups of\nquandles (up to isomorphisms) of order less than or equal to 5 were given. With\nthe help of the software Maple, we compute the inner and automorphism groups of\nall seventy three quandles of order six listed in the appendix of [4]. Since\ncomputations of automorphisms of quandles relates to the problem of\nclassification of quandles, we also describe an algorithm implemented in C for\ncomputing all quandles (up to isomorphism) of order less than or equal to nine.\n","date":"2010-12-23T20:35:01Z","authors":["\n      M. Elhamdadi\n    ","\n      J. MacQuarrie\n    ","\n      R. Restrepo\n    "]},{"title":"Pretzel Knots and q-Series","link":"http://arxiv.org/abs/1512.00129v4","summary":"  The tail of the colored Jones polynomial of an alternating link is a\n$q$-series invariant whose first $n$ terms coincide with the first $n$ terms of\nthe $n$-th colored Jones polynomial. Recently, it has been shown that the tail\nof the colored Jones polynomial of torus knots give rise to Ramanujan type\nidentities. In this paper, we study $q$-series identities coming from the\ncolored Jones polynomial of pretzel knots. We prove a false theta function\nidentity that goes back to Ramanujan and we give a natural generalization of\nthis identity using the tail of the colored Jones polynomial of Pretzel knots.\nFurthermore, we compute the tail for an infinite family of Pretzel knots and\nrelate it to false theta function-type identities.\n","date":"2015-12-01T03:11:47Z","authors":["\n      Mohamed Elhamdadi\n    ","\n      Mustafa Hajij\n    "]},{"title":"Knot groups, quandle extensions and orderability","link":"http://arxiv.org/abs/2307.08605v1","summary":"  This paper gives a new way of characterizing L-space $3$-manifolds by using\norderability of quandles. Hence, this answers a question of Adam Clay et al.\n[Question 1.1 of Canad. Math. Bull. 59 (2016), no. 3, 472-482]. We also\ninvestigate both the orderability and circular orderability of dynamical\nextensions of orderable quandles. We give conditions under which the\nconjugation quandle on a group, as an extension of the conjugation of a\nbi-orderable group by the conjugation of a right orderable group, is right\norderable. We also study the right circular orderability of link quandles. We\nprove that the $n$-quandle $Q_n(L)$ of the link quandle of $L$ is not right\ncircularly orderable and hence it is not right orderable. But on the other\nhand, we show that there are infinitely many links for which the $p$-enveloping\ngroup of the link quandle is right circularly orderable for any prime integer\n$p$.\n","date":"2023-07-17T16:14:52Z","authors":["\n      Idrissa Ba\n    ","\n      Mohamed Elhamdadi\n    "]},{"title":"Deformations of Yang-Baxter operators via $n$-Lie algebra cohomology","link":"http://arxiv.org/abs/2207.13156v2","summary":"  We introduce a cohomology theory of $n$-ary self-distributive objects in the\ntensor category of vector spaces that classifies their infinitesimal\ndeformations. For $n$-ary self-distributive objects obtained from $n$-Lie\nalgebras we show that ($n$-ary) Lie cohomology naturally injects in the\nself-distributive cohomology and we prove, under mild additional assumptions,\nthat the map is an isomorphism of second cohomology groups. This shows that the\nself-distribuitve deformations are completely classified by the deformations of\nthe Lie bracket. This theory has important applications in the study of\nYang-Baxter operators as the self-distributive deformations determine\nnontrivial deformations of the Yang-Baxter operators derived from $n$-ary\nself-distributive structures. In particular, we show that there is a\nhomomorphism from the second self-distributive cohomology to the second\ncohomology of the associated Yang-Baxter operator. Moreover, we prove that when\nthe self-distributive structure is induced by a Lie algebra with trivial\ncenter, we get a monomorphism. We construct a deformation theory based on\nsimultaneous deformations, where both the coalgebra and self-distributive\nstructures are deformed simultaneously. We show that when the Lie algebra has\nnontrivial cohomology (e.g. for semi-simple Lie algebras) the simultaneous\ndeformations might still be nontrivial, producing corresponding Yang-Baxter\noperator deformations. We provide examples and computations in low dimensions,\nand we completely characterize $2$-cocycles for the self-distributive objects\nobtained from all the nontrivial real Lie algebras of dimension $3$, i.e. the\nBianchi I-IX, and all the nontrivial complex Lie algebras of dimension $3$.\n","date":"2022-07-26T19:15:48Z","authors":["\n      Mohamed Elhamdadi\n    ","\n      Emanuele Zappala\n    "]},{"title":"Continuous cohomology of topological quandles","link":"http://arxiv.org/abs/1803.07604v1","summary":"  A continuous cohomology theory for topological quandles is introduced, and\ncompared to the algebraic theories. Extensions of topological quandles are\nstudied with respect to continuous 2-cocycles, and used to show the differences\nin second cohomology groups for specific topological quandles. A method of\ncomputing the cohomology groups of the inverse limit is applied to quandles.\n","date":"2018-03-20T18:58:55Z","authors":["\n      Mohamed Elhamdadi\n    ","\n      Masahico Saito\n    ","\n      Emanuele Zappala\n    "]},{"title":"Decomposition of the regular representation for dihedral quandles","link":"http://arxiv.org/abs/2206.06311v1","summary":"  We decompose the regular quandle representation of a dihedral quandle\n$\\mathcal{R}_n$ into irreducible quandle subrepresentations.\n","date":"2022-06-13T16:49:59Z","authors":["\n      Mohamed Elhamdadi\n    ","\n      Prasad Senesi\n    ","\n      Emanuele Zappala\n    "]},{"title":"Polynomial Invariants of Singular Knots and links","link":"http://arxiv.org/abs/2010.13295v3","summary":"  We generalize the notion of the quandle polynomial to the case of\nsingquandles. We show that the singquandle polynomial is an invariant of finite\nsingquandles. We also construct a singular link invariant from the singquandle\npolynomial and show that this new singular link invariant generalizes the\nsingquandle counting invariant. In particular, using the new polynomial\ninvariant, we can distinguish singular links with the same singquandle counting\ninvariant.\n","date":"2020-10-26T02:52:30Z","authors":["\n      Jose Ceniceros\n    ","\n      Indu R. Churchill\n    ","\n      Mohamed Elhamdadi\n    "]},{"title":"Singquandle Shadows and Singular knot Invariants","link":"http://arxiv.org/abs/2101.08775v1","summary":"  We introduce shadow structures for singular knot theory. Precisely, we define\n\\emph{two} invariants of singular knots and links. First, we introduce a notion\nof action of a singquandle on a set to define a shadow counting invariant of\nsingular links which generalize the classical shadow colorings of knots by\nquandles. We then define a shadow polynomial invariant for shadow structures.\nLastly, we enhance the shadow counting invariant by combining both the shadow\ncounting invariant and the shadow polynomial invariant. Explicit examples of\ncomputations are given.\n","date":"2021-01-21T18:55:41Z","authors":["\n      Jose Ceniceros\n    ","\n      Indu R. Churchill\n    ","\n      Mohamed Elhamdadi\n    "]},{"title":"Topologies, Posets and Finite Quandles","link":"http://arxiv.org/abs/2209.14518v1","summary":"  An Alexandroff space is a topological space in which every intersection of\nopen sets is open. There is one to one correspondence between Alexandroff\n$T_0$-spaces and partially ordered sets (posets). We investigate Alexandroff\n$T_0$-topologies on finite quandles. We prove that there is a non-trivial\ntopology on a finite quandle making right multiplications continuous functions\nif and only if the quandle has more than one orbit. Furthermore, we show that\nright continuous posets on quandles with $n$ orbits are $n$-partite. We also\nfind, for the even dihedral quandles, the number of all possible topologies\nmaking the right multiplications continuous. Some explicit computations for\nquandles of cardinality up to five are given.\n","date":"2022-09-29T02:42:02Z","authors":["\n      Mohamed Elhamdadi\n    ","\n      Tushar Gona\n    ","\n      Hitakshi Lahrani\n    "]},{"title":"The Colored Jones Polynomial of Singular Knots","link":"http://arxiv.org/abs/1602.08628v2","summary":"  We generalize the colored Jones polynomial to $4$-valent graphs. This\ngeneralization is given as a sequence of invariants in which the first term is\na one variable specialization of the Kauffman-Vogel polynomial. We use the\ninvariant we construct to give a sequence of singular braid group\nrepresentations.\n","date":"2016-02-27T19:00:06Z","authors":["\n      Khaled Bataineh\n    ","\n      Mohamed Elhamdadi\n    ","\n      Mustafa Hajij\n    "]},{"title":"The Cocycle structure of the Alexander $f$-quandles on finite fields","link":"http://arxiv.org/abs/1612.08968v2","summary":"  We determine the second, third, and fourth cohomology groups of Alexander\n$f$-quandles of the form $\\mathbb{F}_q[T,S]/ (T-\\omega, S-\\beta)$, where\n$\\mathbb{F}_q$ denotes the finite field of order $q$, $\\omega \\in\n\\mathbb{F}_q\\setminus \\{0,1\\}$, and $\\beta \\in \\mathbb{F}_q$\n","date":"2016-12-28T19:54:04Z","authors":["\n      Indu Rasika Churchill\n    ","\n      Mohamed Elhamdadi\n    ","\n      Neranga Fernando\n    "]},{"title":"On the Classification of Topological Quandles","link":"http://arxiv.org/abs/1803.00671v1","summary":"  We investigate the classification of topological quandles on some simple\nmanifolds. Precisely we classify all Alexander quandle structures, up to\nisomorphism, on the real line and the unit circle. For the closed unit interval\n$[0, 1]$, we conjecture that there exists only one topological quandle\nstructure on it, i.e. the trivial one. Some evidences are provided to support\nour conjecture.\n","date":"2018-03-02T00:30:27Z","authors":["\n      Zhiyun Cheng\n    ","\n      Mohamed Elhamdadi\n    ","\n      Boris Shekhtman\n    "]},{"title":"Framed Knots","link":"http://arxiv.org/abs/1910.10257v6","summary":"  This article gives a foundational account of various characterizations of\nframed links in the $3$-sphere.\n","date":"2019-10-22T22:26:28Z","authors":["\n      Mohamed Elhamdadi\n    ","\n      Mustafa Hajij\n    ","\n      Kyle Istvan\n    "]},{"title":"On the minimum number of Fox Colorings of Knots","link":"http://arxiv.org/abs/2005.11336v2","summary":"  We investigate Fox colorings of knots that are 17-colorable. Precisely, we\nprove that any 17-colorable knot has a diagram such that exactly 6 among the\nseventeen colors are assigned to the arcs of the diagram.\n","date":"2020-05-22T18:04:08Z","authors":["\n      Hamid Abchir\n    ","\n      Mohamed Elhamdadi\n    ","\n      Soukaina Lamsifer\n    "]},{"title":"Higher Arity Self-Distributive Operations in Cascades and their\n  Cohomology","link":"http://arxiv.org/abs/1905.00440v3","summary":"  We investigate constructions of higher arity self-distributive operations,\nand give relations between cohomology groups corresponding to operations of\ndifferent arities. For this purpose we introduce the notion of mutually\ndistributive $n$-ary operations generalizing those for the binary case, and\ndefine a cohomology theory labeled by these operations. A geometric\ninterpretation in terms of framed links is described, with the scope of\nproviding algebraic background of constructing $2$-cocycles for framed link\ninvariants. This theory is also studied in the context of symmetric monoidal\ncategories. Examples from Lie algebras, coalgebras and Hopf algebras are given.\n","date":"2019-05-01T18:14:14Z","authors":["\n      Mohamed Elhamdadi\n    ","\n      Masahico Saito\n    ","\n      Emanuele Zappala\n    "]},{"title":"Heap and Ternary Self-Distributive Cohomology","link":"http://arxiv.org/abs/1910.02877v1","summary":"  Heaps are para-associative ternary operations bijectively exemplified by\ngroups via the operation $(x,y,z) \\mapsto x y^{-1} z$. They are also ternary\nself-distributive, and have a diagrammatic interpretation in terms of framed\nlinks. Motivated by these properties, we define para-associative and heap\ncohomology theories and also a ternary self-distributive cohomology theory with\nabelian heap coefficients. We show that one of the heap cohomologies is related\nto group cohomology via a long exact sequence. Moreover we construct maps\nbetween second cohomology groups of normalized group cohomology and heap\ncohomology, and show that the latter injects into the ternary self-distributive\nsecond cohomology group. We proceed to study heap objects in symmetric monoidal\ncategories providing a characterization of pointed heaps as involutory Hopf\nmonoids in the given category. Finally we prove that heap objects are also\n\"categorically\" self-distributive in an appropriate sense.\n","date":"2019-10-07T16:01:33Z","authors":["\n      Mohamed Elhamdadi\n    ","\n      Masahico Saito\n    ","\n      Emanuele Zappala\n    "]},{"title":"Enhancement of the Coloring Invariant for Folded Molecular Chains","link":"http://arxiv.org/abs/2012.00210v1","summary":"  Folded linear molecular chains are ubiquitous in biology. Folding is mediated\nby intra-chain interactions that \"glue\" two or more regions of a chain. The\nresulting fold topology is widely believed to be a determinant of biomolecular\nproperties and function. Recently, knot theory has been extended to describe\nthe topology of folded linear chains such as proteins and nucleic acids. To\nclassify and distinguish chain topologies, algebraic structure of quandles has\nbeen adapted and applied. However, the approach is limited as apparently\ndistinct topologies may end up having the same number of colorings. Here, we\nenhance the resolving power of the quandle coloring approach by introducing\nBoltzmann weights. We demonstrate that the enhanced coloring invariants can\ndistinguish fold topologies with an improved resolution.\n","date":"2020-12-01T01:42:05Z","authors":["\n      Jose Ceniceros\n    ","\n      Mohamed Elhamdadi\n    ","\n      Alireza Mashaghi\n    "]},{"title":"Ternary Distributive Structures and Quandles","link":"http://arxiv.org/abs/1403.7099v1","summary":"  We introduce a notion of ternary distributive algebraic structure, give\nexamples, and relate it to the notion of a quandle. Classification is given for\nlow order structures of this type. Constructions of such structures from\nternary bialgebras are provided. We also describe ternary distributive\nalgebraic structures coming from groups and give examples from vector spaces\nwhose bases are elements of a finite ternary distributive set. We introduce a\ncohomology theory that is analogous to Hochschild cohomology and relate it to a\nformal deformation theory of these structures.\n","date":"2014-03-27T15:51:48Z","authors":["\n      Mohamed Elhamdadi\n    ","\n      Matthew Green\n    ","\n      Abdenacer Makhlouf\n    "]},{"title":"Foundations of topological racks and quandles","link":"http://arxiv.org/abs/1506.00084v1","summary":"  We give a foundational account on topological racks and quandles.\nSpecifically, we define the notions of ideals, kernels, units, and inner\nautomorphism group in the context of topological racks. Further, we investigate\ntopological rack modules and principal rack bundles. Central extensions of\ntopological racks are then introduced providing a first step towards a general\ncontinuous cohomology theory for topological racks and quandles.\n","date":"2015-05-30T07:22:38Z","authors":["\n      Mohamed Elhamdadi\n    ","\n      El-kaïoum M. Moutuou\n    "]},{"title":"Twist Regions and Coefficients Stability of the Colored Jones Polynomial","link":"http://arxiv.org/abs/1605.04972v3","summary":"  We prove that the coefficients of the colored Jones polynomial of alternating\nlinks stabilize under increasing the number of twists in the twist regions of\nthe link diagram. This gives us an infinite family of $q$-power series derived\nfrom the colored Jones polynomial parametrized by the color and the twist\nregions of the alternating link diagram.\n","date":"2016-05-16T22:26:20Z","authors":["\n      Mohamed Elhamdadi\n    ","\n      Mustafa Hajij\n    ","\n      Masahico Saito\n    "]},{"title":"On Rational Knots and Links in the Solid Torus","link":"http://arxiv.org/abs/1611.05945v5","summary":"  We introduce the notion of rational links in the solid torus. We show that\nrational links in the solid torus are fully characterized by rational tangles,\nand hence by the continued fraction of the rational tangle. Furthermore, we\ngeneralize this by giving an infinite family of ambient isotopy invariants of\ncolored diagrams in the Kauffman bracket skein module of an oriented surface.\n","date":"2016-11-18T01:30:06Z","authors":["\n      Khaled Bataineh\n    ","\n      Mohamed Elhamdadi\n    ","\n      Mustafa Hajij\n    "]},{"title":"Generating sets of Reidemeister moves of oriented singular links and\n  quandles","link":"http://arxiv.org/abs/1702.01150v2","summary":"  We give a generating set of the generalized Reidemeister moves for oriented\nsingular links. We use it to introduce an algebraic structure arising from the\nstudy of oriented singular knots. We give some examples, including some\nnon-isomorphic families of such structures over non-abelian groups. We show\nthat the set of colorings of a singular knot by this new structure is an\ninvariant of oriented singular knots and use it to distinguish some singular\nlinks.\n","date":"2017-02-03T20:42:55Z","authors":["\n      Khaled Bataineh\n    ","\n      Mohamed Elhamdadi\n    ","\n      Mustafa Hajij\n    ","\n      William Youmans\n    "]}]